-- encoding: UTF-8
------------------------------------------------------
-- by: dramatea
-- git: https://github.com/dramatea/Google_Pinyin_IME_extension
-- page: http://dramatea.com/a/31
-- CC BY-NC-SA
-----------------------------------------------------

_MAPPING_TABLE = [[
wj ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
wjx ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
wujiao ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
xing ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
yuan ○,•,●,◎,〇,◐,◑,◕,☉,◙
fang □,■,▣,◘,◙,▪,▫,▧,▨,▁,▂,▃,▄,▅,▆,▇,█,▉,▊,▋,▌,▍,▎,▏,▓,▔,▕,◢,◣,◤,◥
fang □,■,▣,◘,◙,▪,▫,▧,▨,▁,▂,▃,▄,▅,▆,▇,█,▉,▊,▋,▌,▍,▎,▏,▓,▔,▕,◢,◣,◤,◥
lx ◇,◆,◈,♢,♦
ling ◇,◆,◈,♢,♦
sj △,▽,▲,▼,◣,◤,◢,◥,⊿
sjx △,▽,▲,▼,◣,◤,◢,◥,⊿
sanjiao △,▽,▲,▼,◣,◤,◢,◥,⊿
shang ↑,∧,⇧,︿,︽,㊤,⇡,↾,↿,⇈,⇑,⇪,↥,↨,↟,⇞
s ↑,∧,⇧,︿,︽,㊤,⇡,↾,↿,⇈,⇑,⇪,↥,↨,↟,⇞
zhong ㊥
xia ↓,∨,﹀,︾,⇩,㊦,⇣,⇊,⇂,⇃,⇓,↧,↡,↴,⇟
x ↓,∨,﹀,︾,⇩,㊦,⇣,⇊,⇂,⇃,⇓,↧,↡,↴,⇟
zuo ←,«,☜,㊧,⇦,⇇,⇐,◁,◀,◄,⇠,↼,↽,↢,↤,↤,↞,⇜,↩,↫,↰,↲,↵,⇍,↶,↻,⇤,↚,↜
z ←,«,☜,㊧,⇦,⇇,⇐,◁,◀,◄,⇠,↼,↽,↢,↤,↤,↞,⇜,↩,↫,↰,↲,↵,⇍,↶,↻,⇤,↚,↜
you →,»,☞,㊨,㊒,㊝,⇨,▶,▷,►,⇉,⇢,↠,↠,⇒,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➝,⇀,⇁,➛,➜,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,➻,➼,➽,➸,➳,➺,➻,➵,↣,↦,↪,↬,↱,↳,⇏,↷,↺,⇥,↛,↝
y →,»,☞,㊨,㊒,㊝,⇨,▶,▷,►,⇉,⇢,↠,↠,⇒,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➝,⇀,⇁,➛,➜,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,➻,➼,➽,➸,➳,➺,➻,➵,↣,↦,↪,↬,↱,↳,⇏,↷,↺,⇥,↛,↝
zuoshang ↖,⇖
zs ↖,⇖
youshang ↗,➚,➶,➹,⇗
ys ↗,➚,➶,➹,⇗
zuoxia ↙,⇙
zx ↙,⇙
youxia ↘,➴,➷,⇘
yx ↘,➴,➷,⇘
zuoyou ↔,⇄,⇆,⇋,⇌,⇔,↹,⇎,↭,↮
zy ↔,⇄,⇆,⇋,⇌,⇔,↹,⇎,↭,↮
shangxia ↕,⇅
sx ↕,⇅,囍
jiantou ↑,↓,←,→,↖,↗,↙,↘,↔,↕,➻,➼,➽,➸,➳,➺,➻,➴,➵,➶,➷,➹,▶,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➚,➛,➜,➝,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,↚,↛,↜,↝,↞,↟,↠,↠,↡,↢,↣,↤,↤,↥,↦,↧,↨,⇄,⇅,⇆,⇇,⇈,⇉,⇊,⇋,⇌,⇍,⇎,⇏,⇐,⇑,⇒,⇓,⇔,⇖,⇗,⇘,⇙,⇜,↩,↪,↫,↬,↭,↮,↯,↰,↱,↲,↳,↴,↵,↶,↷,↸,↹,↺,↻,↼,↽,↾,↿,⇀,⇁,⇂,⇃,⇞,⇟,⇠,⇡,⇢,⇣,⇤,⇥,⇦,⇧,⇨,⇩,⇪
jt ↑,↓,←,→,↖,↗,↙,↘,↔,↕,➻,➼,➽,➸,➳,➺,➻,➴,➵,➶,➷,➹,▶,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➚,➛,➜,➝,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,↚,↛,↜,↝,↞,↟,↠,↠,↡,↢,↣,↤,↤,↥,↦,↧,↨,⇄,⇅,⇆,⇇,⇈,⇉,⇊,⇋,⇌,⇍,⇎,⇏,⇐,⇑,⇒,⇓,⇔,⇖,⇗,⇘,⇙,⇜,↩,↪,↫,↬,↭,↮,↯,↰,↱,↲,↳,↴,↵,↶,↷,↸,↹,↺,↻,↼,↽,↾,↿,⇀,⇁,⇂,⇃,⇞,⇟,⇠,⇡,⇢,⇣,⇤,⇥,⇦,⇧,⇨,⇩,⇪
biao ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
b ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
biaoge ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
biaoa ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥
biaob ═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
banyuan ⌒,╭╮,╰,╯,╭,╮,︵,︶
xuanzhuan ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
zhuanxiang ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
zhuan ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
jiedi 〦,〧,〨
zhuce ®
zc ®
register ®
reg ®
r ®
banquan ©
bq ©
copy ©
c ©
shangbiao ™
sb ™
tm ™
du °
oumu Ω,ω
dianzu Ω,ω
dz Ω,ω
wendu ℃,℉
wd ℃,℉
sheshidu ℃
ssd ℃
huashidu ℉
hsd ℉
qianfen ‰
qf ‰
haoke ㎎
mg ㎎
qianke ㎏
kg ㎏
haomi ㎜
mm ㎜
limi ㎝
cm ㎝
qianmi ㎞,㏎
km ㎞,㏎
pingfangmi ㎡
pfm ㎡
cc ㏄
ln ㏑
log ㏒
mil ㏕
huobi ¤,￥,¥,$,¢,€,£,₣,฿,₡,₠,₢,₯,₫,₭,₤,₥,₦,₰,₧,₱,₨,৳,₪,₩,₮
hb ¤,￥,¥,$,¢,€,£,₣,฿,₡,₠,₢,₯,₫,₭,₤,₥,₦,₰,₧,₱,₨,৳,₪,₩,₮
rmb ￥,¥
chuizhi ⊥
jiaodu ∠
jia +
jian -
cheng ×
chu ÷
zhengfu ±
zf ±
yinwei ∵
yw ∵
suoyi ∴
sy ∴
dengyu ∷,≈
dy ∷,≈
ydy ≈
bolang ﹌,≈
wuxian ∞
wxd ∞
dui √,✓,✔,☑
cuo ×,✕,✖
shuangxi 囍
nan ♂,㊚
nv ♀,㊛
zheng ㊣
zhu ㈱,㊑
jin ㊎
mu ㊍
shui ㊌
huo ㊋
tu ㊏
ri ㊐
yue ㊊
she ㊓
ming ㊔
te ㊕
cai ㊖
zhu ㊗
lao ㊘
shi ✚,╬,✣,✤,✥,⊹,✟,⊕,⑩,㊜
yin ㊞
zhu ㊟
xiang ㊠
xiu ㊡
xie ㊢,✎,✐,✍,㊯
bi ✐,✎,✍
yi ㊩
zong ㊪
xue ㊫
jian ㊬
qi ⑦,㊭
zi ㊮
ye ✌,㊰
quanzi 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ,㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
quan 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ,㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
qzm ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
qhz ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
qsz ①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,◎,⊙
pinyin ā,á,ǎ,à,ō,ó,ǒ,ò,ê,ē,é,ě,è,ê,ī,í,ǐ,ì,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,,ń,ň,
py ā,á,ǎ,à,ō,ó,ǒ,ò,ê,ē,é,ě,è,ê,ī,í,ǐ,ì,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,,ń,ň,
zhuyin ㄅ,ㄆ,ㄇ,ㄈ,ㄉ,ㄊ,ㄋ,ㄌ,ㄍ,ㄎ,ㄏ,ㄐ,ㄑ,ㄒ,ㄓ,ㄔ,ㄕ,ㄖ,ㄗ,ㄘ,ㄙ,ㄚ,ㄛ,ㄜ,ㄝ,ㄞ,ㄟ,ㄠ,ㄡ,ㄢ,ㄣ,ㄤ,ㄥ,ㄦ,ㄧ,ㄨ,ㄩ
riyu ぁ,あ,ぃ,い,ぅ,う,ぇ,え,ぉ,お,か,が,き,ぎ,く,ぐ,け,げ,こ,ご,さ,ざ,し,じ,す,ず,せ,ぜ,そ,ぞ,た,だ,ち,ぢ,っ,つ,づ,て,で,と,ど,な,に,ぬ,ね,の,は,ば,ぱ,ひ,び,ぴ,ふ,ぶ,ぷ,へ,べ,ぺ,ほ,ぼ,ぽ,ま,み,む,め,も,ゃ,や,ゅ,ゆ,ょ,よ,ら,り,る,れ,ろ,ゎ,わ,ゐ,ゑ,を,ん
riwen ぁ,あ,ぃ,い,ぅ,う,ぇ,え,ぉ,お,か,が,き,ぎ,く,ぐ,け,げ,こ,ご,さ,ざ,し,じ,す,ず,せ,ぜ,そ,ぞ,た,だ,ち,ぢ,っ,つ,づ,て,で,と,ど,な,に,ぬ,ね,の,は,ば,ぱ,ひ,び,ぴ,ふ,ぶ,ぷ,へ,べ,ぺ,ほ,ぼ,ぽ,ま,み,む,め,も,ゃ,や,ゅ,ゆ,ょ,よ,ら,り,る,れ,ろ,ゎ,わ,ゐ,ゑ,を,ん
ewen А,Б,В,Г,Д,Е,Ё,Ж,З,И,Й,К,Л,М,Н,О,П,Р,С,Т,У,Ф,Х,Ц,Ч,Ш,Щ,Ъ,Ы,Ь,Э,Ю,Я,а,б,в,г,д,е,ё,ж,з,и,й,к,л,м,н,о,п,р,с,т,у,ф,х,ц,ч,ш,щ,ъ,ы,ь,э,ю,я
xila Α,Β,Γ,Δ,Ε,Ζ,Η,Θ,Ι,Κ,∧,Μ,Ν,Ξ,Ο,∏,Ρ,∑,Τ,Υ,Φ,Χ,Ψ,Ω,α,β,γ,δ,ε,ζ,η,θ,ι,κ,λ,μ,ν,ξ,ο,π,ρ,σ,τ,υ,φ,χ,ψ,ω
xiladx Α,Β,Γ,Δ,Ε,Ζ,Η,Θ,Ι,Κ,∧,Μ,Ν,Ξ,Ο,∏,Ρ,∑,Τ,Υ,Φ,Χ,Ψ,Ω
xilaxx α,β,γ,δ,ε,ζ,η,θ,ι,κ,λ,μ,ν,ξ,ο,π,ρ,σ,τ,υ,φ,χ,ψ,ω
wan 卐,卍
fu 卐,卍
no №
tel ℡,☎,☏
dianhua ℡,☎,☏
hua ✿,❀,❃,❁,✲,❈,❦,❧
jiandao ✄
kulou ☠
weixian ☣,☢,☠
wx ☣,☢,☠
danger ☣,☢,☠
fushe ☣,☢
gcd ☭
xingyue ☪
xy ☪
cha ♨
reqi ♨
xiaolian ☺,☻
xl ☺,☻
taiyang ☼,☀,❂
ty ☼,☀,❂
yun ☁
san ☂,③
erji ☊,☋
luoxuan ๑

xueren ☃
huixing ☄
puke ♠,♤,♢,♦,♣,♧,♥
yinyue ♩,♪,♫,♬,♭,♮,♯
aixin ❤,♥,♡,❥,❣
xin ❤,♥,♡,❥,❣
shou ☜,☞,✌,✍
wangwen ▧,▨,▤,▥,▦,▩,▒,░
qita ⊱⋛⋌큐₪♈⋚⊰۩┱ ┲
]]


_MAPPING_TABLE_PinYin = [[
a ā,á,ǎ,à
o ō,ó,ǒ,ò
e ê,ē,é,ě,è,ê
i ī,í,ǐ,ì
u ū,ú,ǔ,ù
v ǖ,ǘ,ǚ,ǜ,ü
yu ǖ,ǘ,ǚ,ǜ,ü
m 
n ń,ň,
]]


_MAPPING_TABLE_YinBiao = [[
gjyy a:,ә:,i:,ɔ:,u:,Λ,ә,i,ɔ,u,ae,e,ai,ei,ɔi,iә,εə,uә,au,әu
gjfy p,t,k,f,s,∫,t∫,tr,θ,ts,b,d,g,v,z,ʒ,dʒ,dr,ð,dz,m,n,η,h,r,l,w,j
gj  a:,ә:,i:,ɔ:,u:,Λ,ә,i,ɔ,u,ae,e,ai,ei,ɔi,iә,εə,uә,au,әu,p,t,k,f,s,∫,t∫,tr,θ,ts,b,d,g,v,z,ʒ,dʒ,dr,ð,dz,m,n,η,h,r,l,w,j
kkyy i,аr,o,u,ɝ,ɚ,Ⅰ,а,ɔ,Ʋ,ʌ,ə,ɛ,аⅠ,ei,ɔⅠ,ɛə,Ʋr,аƲ,ɔr,Ⅰə
kkfy p,t,k,f,s,θ,ʃ,ʧ,b,d,g,v,z,th,ʒ,ʤ,m,n,ŋ,h,r,l,w,j
kk i,аr,o,u,ɝ,ɚ,Ⅰ,а,ɔ,Ʋ,ʌ,ə,ɛ,аⅠ,ei,ɔⅠ,ɛə,Ʋr,аƲ,ɔr,Ⅰə,p,t,k,f,s,θ,ʃ,ʧ,b,d,g,v,z,th,ʒ,ʤ,m,n,ŋ,h,r,l,w,j
ipayy i,y,ɨ,ʉ,ɯ,u,ɪ,ʏ,ɪ̈,ʊ̈,ʊ,e,ø,ɘ,ɵ,ɤ,o,e̞,ø̞,ə,ɤ̞,o̞,ɛ,œ,ɜ,ɞ,ʌ,ɔ,æ,ɐ,a,ɶ,ä,ɑ,ɒ,m̥,m,ɱ,n̪,n̥,n,n̠,ɳ̊,ɳ,ɲ̟,ɲ̊,ɲ,ŋ̊,ŋ,ɴ,p,b,p̪,b̪,t̪,d̪,t,d,ʈ,ɖ,c,ɟ,k,ɡ,q,ɢ,ʡ,ʔ,s̪,z̪,s,z,ʃ,ʒ,ʂ,ʐ,ɕ,ʑ,ɸ,β,f,v,θ,ð,θ̱,ð̠,ç,ʝ,x,ɣ,χ,ʁ,ħ,ʕ,ʜ,ʢ,h,ɦ,β̞,ʋ,ɹ,ɻ,j̊,j,ɰ,ⱱ̟,ⱱ,ɾ,ɽ,ɢ̆,ʡ̯,ʙ,r̥,r,ɽ͡r,ʀ,ᴙ,ɬ,ɮ,ʎ̝̊,ʟ̝̊,ʟ̝,l̥,l,ɭ,ʎ̟,ʎ,ʟ,ɺ,ɺ̢,ʎ̯,ʟ̆
ipayy i,y,ɨ,ʉ,ɯ,u,ɪ,ʏ,ɪ̈,ʊ̈,ʊ,e,ø,ɘ,ɵ,ɤ,o,e̞,ø̞,ə,ɤ̞,o̞,ɛ,œ,ɜ,ɞ,ʌ,ɔ,æ,ɐ,a,ɶ,ä,ɑ,ɒ
ipafy m̥,m,ɱ,n̪,n̥,n,n̠,ɳ̊,ɳ,ɲ̟,ɲ̊,ɲ,ŋ̊,ŋ,ɴ,p,b,p̪,b̪,t̪,d̪,t,d,ʈ,ɖ,c,ɟ,k,ɡ,q,ɢ,ʡ,ʔ,s̪,z̪,s,z,ʃ,ʒ,ʂ,ʐ,ɕ,ʑ,ɸ,β,f,v,θ,ð,θ̱,ð̠,ç,ʝ,x,ɣ,χ,ʁ,ħ,ʕ,ʜ,ʢ,h,ɦ,β̞,ʋ,ɹ,ɻ,j̊,j,ɰ,ⱱ̟,ⱱ,ɾ,ɽ,ɢ̆,ʡ̯,ʙ,r̥,r,ɽ͡r,ʀ,ᴙ,ɬ,ɮ,ʎ̝̊,ʟ̝̊,ʟ̝,l̥,l,ɭ,ʎ̟,ʎ,ʟ,ɺ,ɺ̢,ʎ̯,ʟ̆
]]

_MAPPING_TABLE_Quan = [[
a ⓐ
b ⓑ
c ⓒ,©
d ⓓ
e ⓔ
f ⓕ
g ⓖ
h ⓗ
i ⓘ
j ⓙ
k ⓚ
l ⓛ
m ⓜ
n ⓝ
o ⓞ
p ⓟ
q ⓠ
r ⓡ,®
s ⓢ
t ⓣ
u ⓤ
v ⓥ
w ⓦ
x ⓧ
y ⓨ
z ⓩ
jin ㊎
mu ㊍
shui ㊌
huo ㊋
tu ㊏
nan ㊚
nv ㊛
ri ㊐
yue ㊊
zhu ㊑
you ㊒
she ㊓
ming ㊔
te ㊕
cai ㊖
zhu ㊗
lao ㊘
bao ㊝
yin ㊞
zhu ㊟
xian ㊠
xiu ㊡
xie ㊢
zheng ㊣
shang ㊤
zhong ㊥
xia ㊦
zuo ㊧
you ㊨
zong ㊪
zi ㊫
jian ㊬
zi ㊮
xie ㊯
ye ㊰
yi ㊩,①
er ②
san ③
si ④
wu ⑤
liu ⑥
qi ⑦,㊭
ba ⑧
jiu ⑨
shi ⑩,㊜
dian ⊙
shuzi 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,⊙
sz 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,⊙
zm ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
zimu ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
hanzi ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
hz ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
]]



_MAPPING_TABLE_Xuhao = [[
0 〇,◎
1 ①,⑴,Ⅰ
2 ②,⑵,Ⅱ
3 ③,⑶,Ⅲ
4 ④,⑷,Ⅳ
5 ⑤,⑸,Ⅴ
6 ⑥,⑹,Ⅵ
7 ⑦,⑺,Ⅶ
8 ⑧,⑻,Ⅷ
9 ⑨,⑼,Ⅸ
10 ⑩,⑽,Ⅹ
11 ⑪,⑾,Ⅺ
12 ⑫,⑿,Ⅻ
13 ⑬,⒀
14 ⑭,⒁
15 ⑮,⒂
16 ⑯,⒃
17 ⑰,⒄
18 ⑱,⒅
19 ⑲,⒆
20 ⑳,⒇
]]


-- 表情里不能有空格，否则无法正常使用。暂用全角空格（　）代替
_MAPPING_TABLE_BiaoQing = [[
a :-),:-(,:)),;-),:-D,:-P,:'(,:-O,:-/,:-S,8-),xc==,XD,:D,:O,:-*,=-D,:-|,:@,<3
b o_O,^_^,T_T,=_=",-,-,(×_×),=3=,z_Z,$_$,(^_-)db(-_^),=　=b,^_^;;;,(-_-)|,/.\,QQ,><,ˊˋ,@_@,TAT,OAO,Σ(　°　△　°),(=^_^=),((。(^_^)。)),*\(^_^)/*,≧◇≦,/o\,(!o~o!),-0-,ˋ0ˊ@+%@&$*&,^(oo)^,^(00)^,>//////<,lol,>-<,<*^.^*>,^+++^,^.<,>.^,(^o^)~~(^0^)~~(^0^)~~,TvT,>3<,(*^．^*),T^T"///,(T_T),m(_　_)m,T-T,QAQ,TAT,(｡í　_　ì｡),(#‵′),0.0,O-O,(*>　ω　<*),ψ(._.　)>,≧ω≦,Σヽ(ﾟД　ﾟ;　)ﾉ,(¬_¬),@x@,_(√　ζ　ε:)_,ˊ_>ˋ
c (￣﹁￣),(　h_n　),ˇ.ˇ,‧★,:*:‧\(￣▽￣)/‧:*‧°★*,(⊙０⊙),v(￣︶￣)y,ㄟ(￣▽￣ㄟ),(　￣□￣)/　<(￣ㄧ￣　)　<(￣ㄧ￣　),ε٩(๑>　₃　<)۶з,　(≖‿ゝ≖)✧,＜（￣︶￣）＞,＜（￣︶￣）／,(╬☉д⊙),＜（＠￣︶￣＠）＞,（＃￣▽￣＃）,＼（￣︶￣）／,ｂ（￣▽￣）ｄ,╰（￣▽￣）╭,（￣︶￣）↗,○（＊￣︶￣＊）○,♀（￣▽￣）／,♂（￣▽￣）／,╮（╯◇╰）╭,╭（′▽‵）╭（′▽‵）╭（′▽‵）╯,（￣▽￣）～■□～（￣▽￣）,＜（￣︶￣）＞＜（￣︶￣）＞＜（￣︶￣）＞,\(@^０^@)/★,\(^▽^)/,(￣y▽￣)╭,（┬＿┬）,（＞﹏＜）,（┬＿┬）↘,〒▽〒,～＞＿＜～,Ｔ口Ｔ,o(〒﹏〒)o,＝　＝＃,（︶︿︶）,╰（‵□′）╯,◢▆▅▄▃　崩╰(〒皿〒)╯溃　▃▄▅▆◣,＜（－︿－）＞,〈（＿　＿）〉,ｍ（＿　＿）ｍ,(^〈^),ˊ_>ˋ,(　´_ゝ`),(　・_ゝ・),╮(╯3╰)╭,╮(╯_╰)╭,╮(╯▽╰)╭　,╮(￣▽￣)╭,<(　￣︶￣)╱(._.　),﹙ˊ_>ˋ﹚,(￣(工)￣),(　▔___▔)y-～,(　￣　3￣)y▂ξ,(　′-`)y-～,（～￣▽￣）～,╭(─╴╴─)╮　▃▇,<(‵▽′)>,O-(///￣皿￣)☞　─═≡☆゜★█▇▆▅▄▃▂＿,(　☉_☉)≡☞o────★°,○(￣︿￣)　○─═★°,Ｏ口Ｏ！,(”・ω・)”うー！(／・ω・)／にゃー！,┌（┌　＾o＾）┐,(σ′▽‵)′▽‵)σ,◎−◎？,╮(－_－),＝　＝＃,≧▽≦,^◎-,\("▔□▔)/\("▔□▔)/\("▔□▔)/
d (っ´▽`)っ,‎(っ^///^)っ,｡:.ﾟヽ(*´∀`)ﾉﾟ.:｡,(　´　▽　`　)ﾉ　(　´　▽　`　)っ,ヾ(*´∀｀*)ノ,ヾ(●´▽｀●)ノ,ヽ(#`Д´)ﾉ,╰(*´︶`*)╯♡,(,,　･∀･)ﾉ゛,ヽ(ﾟДﾟ)ﾉ,(　♥´∀`♥)ﾉ,┐(´　д｀)┌,(っ´ω`c),(*ﾟ▽ﾟ)ﾉ,(ง　•̀_•́)ง	,ψ(‵▽′)ψ,(っ　ﾟД　ﾟ)っ,･ﾟ｡｡ﾟ(ﾉД‵)ﾉ･ﾟ｡,(ﾟДﾟ;),(ﾉˊДˋ),(　ﾟ∀　ﾟ),(　*・ω・)✄╰ひ╯,(　*・ω・)✄╰ひ╯→(　*・ω・)╰✄-╯→(　*・ω・)╰—╯✄
ku :'(,T_T,TAT,(T_T),(┬＿┬),T-T,T^T",%>_<%,QAQ,::>_<::,～＞＿＜～,╥﹏╥,〒_〒,(*>﹏<*),（T﹏T）,....>o<....,Ｔ口Ｔ,╭(　T　□　T　)╮,o(〒﹏〒)o,･ﾟ｡｡ﾟ(ﾉД‵)ﾉ･ﾟ｡,இдஇ,〒皿〒,〒▽〒,(〒︿〒﹀,┭┭﹏┭┭
xiao :-),;-),:)),:-D,:-P,8-),:D,XD,^_^,<*^.^*>,^+++^,(^o^)~~,=^_^=,#^_^#,*^◎^*,Y(^_^)Y,\(^▽^)/,^_^",>(￣︶￣)<,＼（￣︶￣）／,＜（￣︶￣）＞,(￣y▽￣)╭,(　ﾟ∀　ﾟ),✿◠‿◠✿~,o(*≥▽≤)ツ┏━┓,^◎-,ψ(‵▽′)ψ,ヾ(*´∀｀*)ノ,ヾ(●´▽｀●)ノ,∩０∩,∩︿∩,∩ε　∩,∩　3∩,∩ω∩,∩﹏∩,∩△∩,∩▽∩,∩__∩y
--生气
shengqi :-(,:@,＝　＝＃,ˋ0ˊ@+%@&$*&,（︶︿︶）,╰（‵□′）╯,ヽ(#`Д´)ﾉ,(#‵′)
--难过
nanguo (｡í　_　ì｡)
--掀桌
xianzhuo o(*≥▽≤)ツ┏━┓,(/＞皿＜)/　～　┴┴,（╯－＿－）╯╧╧,(／‵Д′)／~　╧╧,（╯‵□′）╯︵┴─┴,╯-____-)╯~═╩════╩═~,（╯‵□′）╯︵┴─┴,（ノ*-_-*)ノ┴—┴,～～((ノ*T_T*)ノ┴—┴
--惊/吓/瞪
jing :-O,:O,o_O,OAO,Σ(　°　△　°),(!o~o!),Σヽ(ﾟД　ﾟ;　)ﾉ,(⊙０⊙),(╬☉д⊙)
--怀疑
huaiyi :-/,(¬_¬),
--困惑/囧/无奈/尴尬
jiong :-S,:-|,=_=",-，-,=3=,(-_-)|,/o\,O-O
--吐
tu xc==,
--晕/汗颜
yun --!,(×_×),=　=b,@_@
--难过
nanguo ˊˋ,
--卖萌
meng (=^_^=),≧ω≦,(≖‿ゝ≖)✧
--加油
jiayou *\(^_^)/*
--感动
gandong ≧◇≦,TvT,
--亲一个
qing >3<,
--猪
zhu ^(oo)^,^(00)^
--膜拜
bai m(_　_)m,
--害羞
haixiu (*>　ω　<*),＜（＠￣︶￣＠）＞,（＃￣▽￣＃）,
--淡定
danding ˊ_>ˋ
--口水
koushui (￣﹁￣)
--睡着
shuizhao z_Z,ˇ.ˇ
--撒花
sahua ‧★,:*:‧\(￣▽￣)/‧:*‧°★*,
--得意/满足
deyi v(￣︶￣)y,＜（￣︶￣）＞,＜（￣︶￣）／,＜（＠￣︶￣＠）＞
--逃跑
taopao ㄟ(￣▽￣ㄟ)
--bao
bao ε٩(๑>　₃　<)۶з,＼（￣︶￣）／,
]]


_MAPPING = ime.parse_mapping(_MAPPING_TABLE, "\n", " ", ",")
_MAPPING_PinYin = ime.parse_mapping(_MAPPING_TABLE_PinYin, "\n", " ", ",")
_MAPPING_YinBiao = ime.parse_mapping(_MAPPING_TABLE_YinBiao, "\n", " ", ",")
_MAPPING_Quan = ime.parse_mapping(_MAPPING_TABLE_Quan, "\n", " ", ",")
_MAPPING_Xuhao = ime.parse_mapping(_MAPPING_TABLE_Xuhao, "\n", " ", ",")
_MAPPING_BiaoQing = ime.parse_mapping(_MAPPING_TABLE_BiaoQing, "\n", " ", ",")


function Symbol(input)
  if _MAPPING[input] then
    return _MAPPING[input]
  else
    error("Invalid argument")
  end
end

function PinYin(input)
  if _MAPPING_PinYin[input] then
    return _MAPPING_PinYin[input]
  else
    error("Invalid argument")
  end
end


function YinBiao(input)
  if _MAPPING_YinBiao[input] then
    return _MAPPING_YinBiao[input]
  else
    error("Invalid argument")
  end
end

function Quan(input)
  if _MAPPING_Quan[input] then
    return _MAPPING_Quan[input]
  else
    error("Invalid argument")
  end
end


function SerialNumber(input)
  if _MAPPING_Xuhao[input] then
    return _MAPPING_Xuhao[input]
  else
    error("Invalid argument")
  end
end


function BiaoQing(input)
  if _MAPPING_BiaoQing[input] then
    return _MAPPING_BiaoQing [input]
  else
    error("Invalid argument")
  end
end


ime.register_command("fh", "Symbol", "特殊符号","","输入字母，例如xing,zuo,cm")
ime.register_command("py", "PinYin", "汉语拼音","","输入字母，例如a,e,i,o,u,v")
ime.register_command("yb", "YinBiao", "音标符号","","输入字母，例如kk,gj,kkyy,kkfy,ipayy,ipafy")
ime.register_command("qz", "Quan", "圈字符","","输入字母，例如hz,sz,zm,zheng,yi")
ime.register_command("xh", "SerialNumber", "数字序号","alpha","输入数字，例如1")
ime.register_command("bq", "BiaoQing", "表情符号","","输入字母，例如a,b,c,d,e")
