-- encoding: UTF-8
------------------------------------------------------
-- by dramatea
-- update:
--				2013-03-21
-- 			http://dramatea.com/a/31
-- CC BY-NC-SA
-----------------------------------------------------

_MAPPING_TABLE = [[
wj ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
wjx ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
wujiao ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
xing ★,✩,✪,✡,✫,✰,☆,✬,✭,✮
yuan ○,•,●,◎,〇,◐,◑,◕,☉,◙
fang □,■,▣,◘,◙,▪,▫,▧,▨
fx □,■,▣,◘,◙,▪,▫,▧,▨
lx ◇,◆,◈,♢,♦
ling ◇,◆,◈,♢,♦
sj △,▽,▲,▼,◣,◤,◢,◥,⊿
sjx △,▽,▲,▼,◣,◤,◢,◥,⊿
sanjiao △,▽,▲,▼,◣,◤,◢,◥,⊿
shang ↑,∧,⇧,︿,︽,㊤,⇡,↾,↿,⇈,⇑,⇪,↥,↨,↟,⇞
s ↑,∧,⇧,︿,︽,㊤,⇡,↾,↿,⇈,⇑,⇪,↥,↨,↟,⇞
zhong ㊥
xia ↓,∨,﹀,︾,⇩,㊦,⇣,⇊,⇂,⇃,⇓,↧,↡,↴,⇟
x ↓,∨,﹀,︾,⇩,㊦,⇣,⇊,⇂,⇃,⇓,↧,↡,↴,⇟
zuo ←,«,☜,㊧,⇦,⇇,⇐,◁,◀,◄,⇠,↼,↽,↢,↤,↤,↞,⇜,↩,↫,↰,↲,↵,⇍,↶,↻,⇤,↚,↜
z ←,«,☜,㊧,⇦,⇇,⇐,◁,◀,◄,⇠,↼,↽,↢,↤,↤,↞,⇜,↩,↫,↰,↲,↵,⇍,↶,↻,⇤,↚,↜
you →,»,☞,㊨,㊒,㊝,⇨,▶,▷,►,⇉,⇢,↠,↠,⇒,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➝,⇀,⇁,➛,➜,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,➻,➼,➽,➸,➳,➺,➻,➵,↣,↦,↪,↬,↱,↳,⇏,↷,↺,⇥,↛,↝
y →,»,☞,㊨,㊒,㊝,⇨,▶,▷,►,⇉,⇢,↠,↠,⇒,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➝,⇀,⇁,➛,➜,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,➻,➼,➽,➸,➳,➺,➻,➵,↣,↦,↪,↬,↱,↳,⇏,↷,↺,⇥,↛,↝
zuoshang ↖,⇖
zs ↖,⇖
youshang ↗,➚,➶,➹,⇗
ys ↗,➚,➶,➹,⇗
zuoxia ↙,⇙
zx ↙,⇙
youxia ↘,➴,➷,⇘
yx ↘,➴,➷,⇘
zuoyou ↔,⇄,⇆,⇋,⇌,⇔,↹,⇎,↭,↮
zy ↔,⇄,⇆,⇋,⇌,⇔,↹,⇎,↭,↮
shangxia ↕,⇅
sx ↕,⇅,囍
jiantou ↑,↓,←,→,↖,↗,↙,↘,↔,↕,➻,➼,➽,➸,➳,➺,➻,➴,➵,➶,➷,➹,▶,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➚,➛,➜,➝,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,↚,↛,↜,↝,↞,↟,↠,↠,↡,↢,↣,↤,↤,↥,↦,↧,↨,⇄,⇅,⇆,⇇,⇈,⇉,⇊,⇋,⇌,⇍,⇎,⇏,⇐,⇑,⇒,⇓,⇔,⇖,⇗,⇘,⇙,⇜,↩,↪,↫,↬,↭,↮,↯,↰,↱,↲,↳,↴,↵,↶,↷,↸,↹,↺,↻,↼,↽,↾,↿,⇀,⇁,⇂,⇃,⇞,⇟,⇠,⇡,⇢,⇣,⇤,⇥,⇦,⇧,⇨,⇩,⇪
jt ↑,↓,←,→,↖,↗,↙,↘,↔,↕,➻,➼,➽,➸,➳,➺,➻,➴,➵,➶,➷,➹,▶,➩,➪,➫,➬,➭,➮,➯,➱,➲,➾,➔,➘,➙,➚,➛,➜,➝,➞,➟,➠,➡,➢,➣,➤,➥,➦,➧,➨,↚,↛,↜,↝,↞,↟,↠,↠,↡,↢,↣,↤,↤,↥,↦,↧,↨,⇄,⇅,⇆,⇇,⇈,⇉,⇊,⇋,⇌,⇍,⇎,⇏,⇐,⇑,⇒,⇓,⇔,⇖,⇗,⇘,⇙,⇜,↩,↪,↫,↬,↭,↮,↯,↰,↱,↲,↳,↴,↵,↶,↷,↸,↹,↺,↻,↼,↽,↾,↿,⇀,⇁,⇂,⇃,⇞,⇟,⇠,⇡,⇢,⇣,⇤,⇥,⇦,⇧,⇨,⇩,⇪
biao ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
b ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
biaoge ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
biaoa ─,━,│,┃,┄,┅,┆,┇,┈,┉,┊,┋,┌,┍,┎,┏,┐,┑,┒,┓,└,┕,┖,┗,┘,┙,┚,┛,├,┝,┞,┟,┠,┡,┢,┣,┤,┥,┦,┧,┨,┩,┪,┫,┬,┭,┮,┯,┰,┱,┲,┳,┴,┵,┶,┷,┸,┹,┺,┻,┼,┽,┾,┿,╀,╁,╂,╃,╄,╅,╆,╇,╈,╉,╊,╋,┠,┨,┯,┷,┏,┓,┗,┛,┳,⊥
biaob ═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╳,╔,╗,╝,╚,╬,═,╓,╩,﹃,﹄,┌,╭,╮,╯,╰
banyuan ⌒,╭╮,╰,╯,╭,╮,︵,︶
xuanzhuan ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
zhuanxiang ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
zhuan ↰,↱,↲,↳,↴,↵,↶,↷,↺,↻
jiedi 〦,〧,〨
zhuce ®
zc ®
register ®
reg ®
r ®
banquan ©
bq ©
copy ©
c ©
shangbiao ™
sb ™
tm ™
du °
oumu Ω,ω
dianzu Ω,ω
dz Ω,ω
wendu ℃,℉
wd ℃,℉
sheshidu ℃
ssd ℃
huashidu ℉
hsd ℉
qianfen ‰
qf ‰
haoke ㎎
mg ㎎
qianke ㎏
kg ㎏
haomi ㎜
mm ㎜
limi ㎝
cm ㎝
qianmi ㎞,㏎
km ㎞,㏎
pingfangmi ㎡
pfm ㎡
cc ㏄
ln ㏑
log ㏒
mil ㏕
huobi ¤,￥,¥,$,¢,€,£,₣,฿,₡,₠,₢,₯,₫,₭,₤,₥,₦,₰,₧,₱,₨,৳,₪,₩,₮
hb ¤,￥,¥,$,¢,€,£,₣,฿,₡,₠,₢,₯,₫,₭,₤,₥,₦,₰,₧,₱,₨,৳,₪,₩,₮
rmb ￥,¥
chuizhi ⊥
jiaodu ∠
jia +
jian -
cheng ×
chu ÷
zhengfu ±
zf ±
yinwei ∵
yw ∵
suoyi ∴
sy ∴
dengyu ∷,≈
dy ∷,≈
ydy ≈
bolang ﹌,≈
wuxian ∞
wxd ∞
dui √,✓,✔,☑
cuo ×,✕,✖
shuangxi 囍
nan ♂,㊚
nv ♀,㊛
zheng ㊣
zhu ㈱,㊑
jin ㊎
mu ㊍
shui ㊌
huo ㊋
tu ㊏
ri ㊐
yue ㊊
she ㊓
ming ㊔
te ㊕
cai ㊖
zhu ㊗
lao ㊘
shi ✚,╬,✣,✤,✥,⊹,✟,⊕,⑩,㊜
yin ㊞
zhu ㊟
xiang ㊠
xiu ㊡
xie ㊢,✎,✐,✍,㊯
bi ✐,✎,✍
yi ㊩
zong ㊪
xue ㊫
jian ㊬
qi ⑦,㊭
zi ㊮
ye ✌,㊰
quanzi 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ,㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
quan 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ,㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
qzm ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
qhz ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
qsz ①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,◎,⊙
pinyin ā,á,ǎ,à,ō,ó,ǒ,ò,ê,ē,é,ě,è,ê,ī,í,ǐ,ì,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,,ń,ň,
py ā,á,ǎ,à,ō,ó,ǒ,ò,ê,ē,é,ě,è,ê,ī,í,ǐ,ì,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,,ń,ň,
zhuyin ㄅ,ㄆ,ㄇ,ㄈ,ㄉ,ㄊ,ㄋ,ㄌ,ㄍ,ㄎ,ㄏ,ㄐ,ㄑ,ㄒ,ㄓ,ㄔ,ㄕ,ㄖ,ㄗ,ㄘ,ㄙ,ㄚ,ㄛ,ㄜ,ㄝ,ㄞ,ㄟ,ㄠ,ㄡ,ㄢ,ㄣ,ㄤ,ㄥ,ㄦ,ㄧ,ㄨ,ㄩ
wan 卐,卍
fu 卐,卍
no №
tel ℡,☎,☏
dianhua ℡,☎,☏
hua ✿,❀,❃,❁,✲,❈,❦,❧
jiandao ✄
kulou ☠
weixian ☣,☢,☠
wx ☣,☢,☠
danger ☣,☢,☠
fushe ☣,☢
gcd ☭
xingyue ☪
xy ☪
cha ♨
reqi ♨
xiaolian ☺,☻
xl ☺,☻
taiyang ☼,☀,❂
ty ☼,☀,❂
yun ☁
san ☂,③
erji ☊,☋
luoxuan ๑

xueren ☃
huixing ☄
puke ♠,♤,♢,♦,♣,♧,♥
yinyue ♩,♪,♫,♬,♭,♯
aixin ❤,♥,♡,❥,❣
xin ❤,♥,♡,❥,❣
shou ☜,☞,✌,✍
wangwen ▧,▨,▤,▥,▦,▩,▒,░
qita ⊱⋛⋌큐₪♈⋚⊰۩┱ ┲
]]


_MAPPING_TABLE_PinYin = [[
a ā,á,ǎ,à
o ō,ó,ǒ,ò
e ê,ē,é,ě,è,ê
i ī,í,ǐ,ì
u ū,ú,ǔ,ù
v ǖ,ǘ,ǚ,ǜ,ü
yu ǖ,ǘ,ǚ,ǜ,ü
m 
n ń,ň,
]]

辅音:    清辅音：
            浊辅音：
元音： 长元音：
            短元音：
            双元音：

_MAPPING_TABLE_YinBiao = [[
yy i,e,æ,ə,ʌ,ɔ,u,i:,ə:,a:,ɔ:,u:,i,e,æ,ə,ʌ,ɔ,u,i:,ə:,a:,ɔ:,u:
fy b,d,g,v,ð,z,ʒ,r,dʒ,dz,dr,p,t,k,f,θ,s,ʃ,h,tʃ,ts,tr
dyy i,e,æ,ə,ʌ,ɔ,u,i:,ə:,a:,ɔ:,u:
syy ei,ai,ɔi,əu,au,iə,εə,uə
zfy b,d,g,v,ð,z,ʒ,r,dʒ,dz,dr
qfy p,t,k,f,θ,s,ʃ,h,tʃ,ts,tr
]]

_MAPPING_TABLE_Quan = [[
a ⓐ
b ⓑ
c ⓒ,©
d ⓓ
e ⓔ
f ⓕ
g ⓖ
h ⓗ
i ⓘ
j ⓙ
k ⓚ
l ⓛ
m ⓜ
n ⓝ
o ⓞ
p ⓟ
q ⓠ
r ⓡ,®
s ⓢ
t ⓣ
u ⓤ
v ⓥ
w ⓦ
x ⓧ
y ⓨ
z ⓩ
jin ㊎
mu ㊍
shui ㊌
huo ㊋
tu ㊏
nan ㊚
nv ㊛
ri ㊐
yue ㊊
zhu ㊑
you ㊒
she ㊓
ming ㊔
te ㊕
cai ㊖
zhu ㊗
lao ㊘
bao ㊝
yin ㊞
zhu ㊟
xian ㊠
xiu ㊡
xie ㊢
zheng ㊣
shang ㊤
zhong ㊥
xia ㊦
zuo ㊧
you ㊨
zong ㊪
zi ㊫
jian ㊬
zi ㊮
xie ㊯
ye ㊰
yi ㊩,①
er ②
san ③
si ④
wu ⑤
liu ⑥
qi ⑦,㊭
ba ⑧
jiu ⑨
shi ⑩,㊜
dian ⊙
shuzi 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,⊙
sz 〇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,⊙
zm ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
zimu ⓐ,ⓑ,ⓒ,ⓓ,ⓔ,ⓕ,ⓖ,ⓗ,ⓘ,ⓙ,ⓚ,ⓛ,ⓜ,ⓝ,ⓞ,ⓟ,ⓠ,ⓡ,ⓢ,ⓣ,ⓤ,ⓥ,ⓦ,ⓧ,ⓨ,ⓩ
hanzi ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
hz ㊎,㊍,㊌,㊋,㊏,㊚,㊛,㊐,㊊,㊑,㊒,㊓,㊔,㊕,㊖,㊗,㊘,㊜,㊝,㊞,㊟,㊠,㊡,㊢,㊣,㊤,㊥,㊦,㊧,㊨,㊩,㊪,㊫,㊬,㊭,㊮,㊯,㊰
]]



_MAPPING_TABLE_Xuhao = [[
0 〇,◎
1 ①,⑴,Ⅰ
2 ②,⑵,Ⅱ
3 ③,⑶,Ⅲ
4 ④,⑷,Ⅳ
5 ⑤,⑸,Ⅴ
6 ⑥,⑹,Ⅵ
7 ⑦,⑺,Ⅶ
8 ⑧,⑻,Ⅷ
9 ⑨,⑼,Ⅸ
10 ⑩,⑽,Ⅹ
11 ⑪,⑾,Ⅺ
12 ⑫,⑿,Ⅻ
13 ⑬,⒀
14 ⑭,⒁
15 ⑮,⒂
16 ⑯,⒃
17 ⑰,⒄
18 ⑱,⒅
19 ⑲,⒆
20 ⑳,⒇
]]



_MAPPING = ime.parse_mapping(_MAPPING_TABLE, "\n", " ", ",")
_MAPPING_PinYin = ime.parse_mapping(_MAPPING_TABLE_PinYin, "\n", " ", ",")
_MAPPING_YinBiao = ime.parse_mapping(_MAPPING_TABLE_YinBiao, "\n", " ", ",")
_MAPPING_Quan = ime.parse_mapping(_MAPPING_TABLE_Quan, "\n", " ", ",")
_MAPPING_Xuhao = ime.parse_mapping(_MAPPING_TABLE_Xuhao, "\n", " ", ",")


function Symbol(input)
  if _MAPPING[input] then
    return _MAPPING[input]
  else
    error("Invalid argument")
  end
end

function PinYin(input)
  if _MAPPING_PinYin[input] then
    return _MAPPING_PinYin[input]
  else
    error("Invalid argument")
  end
end

function YinBiao(input)
  if _MAPPING_YinBiao[input] then
    return _MAPPING_YinBiao[input]
  else
    error("Invalid argument")
  end
end

function Quan(input)
  if _MAPPING_Quan[input] then
    return _MAPPING_Quan[input]
  else
    error("Invalid argument")
  end
end


function SerialNumber(input)
  if _MAPPING_Xuhao[input] then
    return _MAPPING_Xuhao[input]
  else
    error("Invalid argument")
  end
end

ime.register_command("fh", "Symbol", "特殊符号","","输入字母，例如xing,zuo,cm")
ime.register_command("py", "PinYin", "汉语拼音","","输入字母，例如a,e,i,o,u,v")
ime.register_command("yb", "YinBiao", "音标符号","","输入字母，例如yy,fy,dyy,syy,qfy,zfy")
ime.register_command("qz", "Quan", "圈字符","","输入字母，例如hz,sz,zm,zheng,yi")
ime.register_command("xh", "SerialNumber", "数字序号","alpha","输入数字，例如1")
